Revit 2027 API
BuiltInFailures.ConnectorFailures.JointTypeMismatch Property
 The element has a connector with a fitting joint type mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JointTypeMismatch { get; }
Public Shared ReadOnly Property JointTypeMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JointTypeMismatch {
	FailureDefinitionId^ get ();
}
static member JointTypeMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace